In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [3]:
df = pd.read_csv("/content/HR_comma_sep.csv")

In [4]:
df.head()

   satisfaction_level  last_evaluation  ...  Departments   salary
0                0.38             0.53  ...         sales     low
1                0.80             0.86  ...         sales  medium
2                0.11             0.88  ...         sales  medium
3                0.72             0.87  ...         sales     low
4                0.37             0.52  ...         sales     low

[5 rows x 10 columns]

In [5]:
df2 = pd.read_csv("/content/HR_comma_sep.csv", index_col=0)

In [6]:
df2.head()

                    last_evaluation  number_project  ...  Departments   salary
satisfaction_level                                   ...
0.38                           0.53               2  ...         sales     low
0.80                           0.86               5  ...         sales  medium
0.11                           0.88               7  ...         sales  medium
0.72                           0.87               5  ...         sales     low
0.37                           0.52               2  ...         sales     low

[5 rows x 9 columns]

In [7]:
fruits = pd.DataFrame({'Apples': [30],'Bananas': [21]})
fruits

   Apples  Bananas
0      30       21

In [8]:
fruits = pd.DataFrame([[30, 21]], columns=['Apples', 'Bananas'])
fruits

   Apples  Bananas
0      30       21

In [9]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

In [10]:
fruit_sales = pd.DataFrame({'Apples': [35,41],'Bananas': [21,34]},index=['2017 Sales','2018 Sales'])
fruit_sales

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [11]:
ingredients=pd.Series(['4 cups', '1 cup', '2 large','1 can'], index=['Flour', 'Milk', 'Eggs','Spam'], name='Dinner')
ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [12]:
reviews = pd.read_csv("/content/HR_comma_sep.csv", index_col=0)
pd.set_option('max_rows', 5)
reviews

                    last_evaluation  number_project  ...  Departments   salary
satisfaction_level                                   ...
0.38                           0.53               2  ...         sales     low
0.80                           0.86               5  ...         sales  medium
...                             ...             ...  ...           ...     ...
0.11                           0.96               6  ...       support     low
0.37                           0.52               2  ...       support     low

[14999 rows x 9 columns]

In [13]:
reviews.salary

satisfaction_level
0.38       low
0.80    medium
         ...
0.11       low
0.37       low
Name: salary, Length: 14999, dtype: object

In [14]:
reviews['salary']

satisfaction_level
0.38       low
0.80    medium
         ...
0.11       low
0.37       low
Name: salary, Length: 14999, dtype: object

In [15]:
reviews['salary'][0.38]

satisfaction_level
0.38       low
0.38       low
         ...
0.38    medium
0.38    medium
Name: salary, Length: 189, dtype: object

In [16]:
reviews = pd.read_csv("/content/HR_comma_sep.csv")
pd.set_option('max_rows', 5)
reviews

       satisfaction_level  last_evaluation  ...  Departments   salary
0                    0.38             0.53  ...         sales     low
1                    0.80             0.86  ...         sales  medium
...                   ...              ...  ...           ...     ...
14997                0.11             0.96  ...       support     low
14998                0.37             0.52  ...       support     low

[14999 rows x 10 columns]

In [17]:
reviews['salary'][0]

'low'

In [18]:
reviews.iloc[0]

satisfaction_level     0.38
last_evaluation        0.53
                      ...
Departments           sales
salary                  low
Name: 0, Length: 10, dtype: object

In [19]:
reviews.iloc[:, 0]

0        0.38
1        0.80
         ...
14997    0.11
14998    0.37
Name: satisfaction_level, Length: 14999, dtype: float64

In [20]:
reviews.iloc[:3, 0]

0    0.38
1    0.80
2    0.11
Name: satisfaction_level, dtype: float64

In [21]:
reviews.iloc[1:3, 0]

1    0.80
2    0.11
Name: satisfaction_level, dtype: float64

In [22]:
reviews.iloc[[0, 1, 2], 1]

0    0.53
1    0.86
2    0.88
Name: last_evaluation, dtype: float64

In [23]:
reviews.iloc[-5:]

       satisfaction_level  last_evaluation  ...  Departments   salary
14994                0.40             0.57  ...       support     low
14995                0.37             0.48  ...       support     low
14996                0.37             0.53  ...       support     low
14997                0.11             0.96  ...       support     low
14998                0.37             0.52  ...       support     low

[5 rows x 10 columns]

In [24]:
reviews.loc[0, 'salary']

'low'

In [25]:
reviews.loc[:, ['satisfaction_level', 'left', 'Work_accident']]

       satisfaction_level  left  Work_accident
0                    0.38     1              0
1                    0.80     1              0
...                   ...   ...            ...
14997                0.11     1              0
14998                0.37     1              0

[14999 rows x 3 columns]

In [26]:
reviews.loc[0:50]

    satisfaction_level  last_evaluation  ...  Departments   salary
0                 0.38             0.53  ...         sales     low
1                 0.80             0.86  ...         sales  medium
..                 ...              ...  ...           ...     ...
49                0.43             0.47  ...       support     low
50                0.13             0.78  ...       support     low

[51 rows x 10 columns]

In [27]:
reviews.set_index("Work_accident")

               satisfaction_level  last_evaluation  ...  Departments   salary
Work_accident                                       ...
0                            0.38             0.53  ...         sales     low
0                            0.80             0.86  ...         sales  medium
...                           ...              ...  ...           ...     ...
0                            0.11             0.96  ...       support     low
0                            0.37             0.52  ...       support     low

[14999 rows x 9 columns]

In [28]:
reviews.salary == 'high'

0        False
1        False
         ...
14997    False
14998    False
Name: salary, Length: 14999, dtype: bool

In [29]:
reviews.loc[reviews.salary == 'high']

       satisfaction_level  last_evaluation  ...  Departments   salary
72                   0.45             0.49  ...   product_mng    high
111                  0.09             0.85  ...            hr    high
...                   ...              ...  ...           ...     ...
14941                0.43             0.49  ...         RandD    high
14980                0.76             0.89  ...     technical    high

[1237 rows x 10 columns]

In [30]:
reviews.loc[(reviews.salary == 'low') & (reviews.number_project >= 6)]

       satisfaction_level  last_evaluation  ...  Departments   salary
6                    0.10             0.77  ...         sales     low
11                   0.11             0.81  ...         sales     low
...                   ...              ...  ...           ...     ...
14993                0.76             0.83  ...       support     low
14997                0.11             0.96  ...       support     low

[777 rows x 10 columns]

In [31]:
reviews.loc[(reviews.salary == 'low') | (reviews.number_project >= 6)]

       satisfaction_level  last_evaluation  ...  Departments   salary
0                    0.38             0.53  ...         sales     low
2                    0.11             0.88  ...         sales  medium
...                   ...              ...  ...           ...     ...
14997                0.11             0.96  ...       support     low
14998                0.37             0.52  ...       support     low

[7969 rows x 10 columns]

In [32]:
reviews.loc[reviews.salary.isin(['low', 'medium'])]

       satisfaction_level  last_evaluation  ...  Departments   salary
0                    0.38             0.53  ...         sales     low
1                    0.80             0.86  ...         sales  medium
...                   ...              ...  ...           ...     ...
14997                0.11             0.96  ...       support     low
14998                0.37             0.52  ...       support     low

[13762 rows x 10 columns]

In [33]:
reviews.loc[reviews.salary.notnull()]

       satisfaction_level  last_evaluation  ...  Departments   salary
0                    0.38             0.53  ...         sales     low
1                    0.80             0.86  ...         sales  medium
...                   ...              ...  ...           ...     ...
14997                0.11             0.96  ...       support     low
14998                0.37             0.52  ...       support     low

[14999 rows x 10 columns]

In [34]:
reviews['salary'] = 'everyone'
reviews['salary']

0        everyone
1        everyone
           ...
14997    everyone
14998    everyone
Name: salary, Length: 14999, dtype: object

In [35]:
reviews

       satisfaction_level  last_evaluation  ...  Departments     salary
0                    0.38             0.53  ...         sales  everyone
1                    0.80             0.86  ...         sales  everyone
...                   ...              ...  ...           ...       ...
14997                0.11             0.96  ...       support  everyone
14998                0.37             0.52  ...       support  everyone

[14999 rows x 10 columns]

In [36]:
reviews['index_backwards'] = range(len(reviews), 0, -1)
reviews['index_backwards']

0        14999
1        14998
         ...
14997        2
14998        1
Name: index_backwards, Length: 14999, dtype: int64

In [37]:
reviews

       satisfaction_level  last_evaluation  ...    salary  index_backwards
0                    0.38             0.53  ...  everyone            14999
1                    0.80             0.86  ...  everyone            14998
...                   ...              ...  ...       ...              ...
14997                0.11             0.96  ...  everyone                2
14998                0.37             0.52  ...  everyone                1

[14999 rows x 11 columns]

In [38]:
reviews.average_montly_hours.iloc[:10]

0    157
1    262
    ...
8    224
9    142
Name: average_montly_hours, Length: 10, dtype: int64

In [39]:
reviews.loc[[1,2,3,5,8]]

   satisfaction_level  last_evaluation  ...    salary  index_backwards
1                0.80             0.86  ...  everyone            14998
2                0.11             0.88  ...  everyone            14997
3                0.72             0.87  ...  everyone            14996
5                0.41             0.50  ...  everyone            14994
8                0.89             1.00  ...  everyone            14991

[5 rows x 11 columns]

In [40]:
reviews.satisfaction_level.unique()

array([0.38, 0.8 , 0.11, 0.72, 0.37, 0.41, 0.1 , 0.92, 0.89, 0.42, 0.45,
       0.84, 0.36, 0.78, 0.76, 0.09, 0.46, 0.4 , 0.82, 0.87, 0.57, 0.43,
       0.13, 0.44, 0.39, 0.85, 0.81, 0.9 , 0.74, 0.79, 0.17, 0.24, 0.91,
       0.71, 0.86, 0.14, 0.75, 0.7 , 0.31, 0.73, 0.83, 0.32, 0.54, 0.27,
       0.77, 0.88, 0.48, 0.19, 0.6 , 0.12, 0.61, 0.33, 0.56, 0.47, 0.28,
       0.55, 0.53, 0.59, 0.66, 0.25, 0.34, 0.58, 0.51, 0.35, 0.64, 0.5 ,
       0.23, 0.15, 0.49, 0.3 , 0.63, 0.21, 0.62, 0.29, 0.2 , 0.16, 0.65,
       0.68, 0.67, 0.22, 0.26, 0.99, 0.98, 1.  , 0.52, 0.93, 0.97, 0.69,
       0.94, 0.96, 0.18, 0.95])

In [41]:
reviews.number_project.unique()

array([2, 5, 7, 6, 4, 3])

In [42]:
review_satisfaction_mean = reviews.satisfaction_level.mean()
reviews.satisfaction_level.map(lambda p: p + review_satisfaction_mean)

0        0.992834
1        1.412834
           ...
14997    0.722834
14998    0.982834
Name: satisfaction_level, Length: 14999, dtype: float64

In [43]:
def remean_points(row):
    row.satisfaction_level = row.satisfaction_level - reviews.satisfaction_level.mean()
    return row

reviews.apply(remean_points, axis='columns')

       satisfaction_level  last_evaluation  ...    salary  index_backwards
0               -0.232834             0.53  ...  everyone            14999
1                0.187166             0.86  ...  everyone            14998
...                   ...              ...  ...       ...              ...
14997           -0.502834             0.96  ...  everyone                2
14998           -0.242834             0.52  ...  everyone                1

[14999 rows x 11 columns]

In [44]:
def remean_points(row):
    row= reviews.satisfaction_level.mean()
    return row

reviews.apply(remean_points, axis='index')

satisfaction_level    0.612834
last_evaluation       0.612834
                        ...
salary                0.612834
index_backwards       0.612834
Length: 11, dtype: float64

In [45]:
review_points_mean = reviews.satisfaction_level.mean()
reviews.satisfaction_level - review_points_mean

0       -0.232834
1        0.187166
           ...
14997   -0.502834
14998   -0.242834
Name: satisfaction_level, Length: 14999, dtype: float64

In [46]:
reviews['Departments ']  + " - " + reviews['Departments ']

0            sales - sales
1            sales - sales
               ...
14997    support - support
14998    support - support
Name: Departments , Length: 14999, dtype: object

In [47]:
reviews.number_project.median()

4.0

In [48]:
time_with_project_idx = (reviews.time_spend_company / reviews.number_project).idxmax()
print("time_with_project_idx",time_with_project_idx)
reviews1 = reviews.loc[time_with_project_idx, 'last_evaluation']
reviews1

time_with_project_idx 11196

0.7

In [49]:
reviews

       satisfaction_level  last_evaluation  ...    salary  index_backwards
0                    0.38             0.53  ...  everyone            14999
1                    0.80             0.86  ...  everyone            14998
...                   ...              ...  ...       ...              ...
14997                0.11             0.96  ...  everyone                2
14998                0.37             0.52  ...  everyone                1

[14999 rows x 11 columns]

In [50]:
d1 = reviews['Departments '].map(lambda desc: "sales" in desc).sum()
d2 = reviews['Departments '].map(lambda desc: "support" in desc).sum()
descriptor_counts = pd.Series([d1, d2], index=['sales', 'support'])
descriptor_counts

sales      4140
support    2229
dtype: int64

In [51]:
def stars(row):
    if row['Departments '] == 'sales':
        return 3
    elif row.number_project >= 6:
        return 3
    elif row.number_project >= 2:
        return 2
    else:
        return 1

star_ratings = reviews.apply(stars, axis='columns')
star_ratings

0        3
1        3
        ..
14997    3
14998    2
Length: 14999, dtype: int64